load-tests/trip-service/stress-summary.txt
     ✓ trip creation status is 200 or 201
     ✓ response has trip data

     checks.........................: 100.00% ✓ 34912     ✗ 0    
     data_received..................: 9.4 MB  38 kB/s
     data_sent......................: 8.6 MB  34 kB/s
   ✓ errors.........................: 0.00%   ✓ 0         ✗ 0    
     http_req_blocked...............: avg=115.73µs min=0s      med=0s     max=21.51ms p(90)=0s     p(95)=549.2µs 
     http_req_connecting............: avg=94.44µs  min=0s      med=0s     max=19.26ms p(90)=0s     p(95)=0s      
     http_req_duration..............: avg=5.64s    min=22.78ms med=5s     max=28.2s   p(90)=11.84s p(95)=13.74s  
     ✗ { expected_response:true }...: avg=5.64s    min=22.78ms med=5s     max=28.2s   p(90)=11.84s p(95)=13.74s  
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 17458
     http_req_receiving.............: avg=11.7ms   min=0s      med=1.61ms max=1.8s    p(90)=34.2ms p(95)=52ms    
     http_req_sending...............: avg=60.83µs  min=0s      med=0s     max=12.63ms p(90)=0s     p(95)=517.02µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s     max=0s      p(90)=0s     p(95)=0s      
     http_req_waiting...............: avg=5.62s    min=22.18ms med=5s     max=28.2s   p(90)=11.83s p(95)=13.73s  
     http_reqs......................: 17458   70.136356/s
     iteration_duration.............: avg=5.69s    min=73.07ms med=5.06s  max=28.25s  p(90)=11.9s  p(95)=13.8s   
     iterations.....................: 17456   70.128321/s
     trip_created...................: 100.00% ✓ 17456     ✗ 0    
     vus............................: 47      min=0       max=798
     vus_max........................: 800     min=800     max=800